
## Plan Result (terraform/aws/openhands)

[CI link](https://github.com/boxp/arch/actions/runs/13764347721)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ssm_parameter.google_api_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ssm_parameter.google_api_key will be created
  + resource "aws_ssm_parameter" "google_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Google API Key for OpenHands"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "openhands-google-api-key"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":2895,"Program":"tfcmt","SHA1":"51dcd1c4a1c3320dd9b9fc7218dbdc7bc9702b28","Target":"terraform/aws/openhands","Vars":{},"WorkflowName":"pull_request_target"} -->